

from flask import Flask, request, render_template_string, jsonify
from fuzzywuzzy import process
from gtts import gTTS
import os
import hashlib
import io

app = Flask(__name__)





long_answer_1 = '''هو عباس محمود العقاد (1889 - 1964م) أحد أعلام التجديد الشعري والفكر النقدي في العصر الحديث ، تكونت منه مع زميليه : إبراهيم عبد القادر المازني (1890 - 1949م) ، وعبد الرحمن شكري (1886 - 1958م) ما عُرف بجماعة الديوان ، نسبة إلى "كتاب الديوان في الأدب والنقد" الذي أصدره العقاد والمازني عام 1921م ، وفيه كما في كتابات العقاد المتعددة سواء في مقدمات دواوينه أو مقدماته لدواوين زملائه وبعض أصدقائه شرح لجوهر الشعر (مضمونه) كما تراه مدرسته من كونه تعبيراً عن ذات صاحبه ووجدانه وتعظيم دور الصورة (أي الخيال) في نقل إحساس الشاعر ، والحرص على تماسك القصيدة.'''
long_answer_2 = '''  في الموت وفراق الأحبة تتدفق الأحاسيس الصادقة من الشعراء بلا حواجز ولا وعي ، ولقد تأثر العقاد تأثراً كبيراً بفجيعة وفاة فراشة الأدب الأديبة اللبنانية (مي زيادة) عام 1941م تلك الأديبة المتألقة المتفردة التي كانت كالجوهرة المتلألئة وسط باقة من عمالقة الأدب ، فنظم قصيدته في رثاء الصديقة والشاعرة والإنسانة ، وقد تناول في القصيدة مكانتها وأوصافها وصفاتها الخلقية والعقلية ، وذلك بعاطفة صادقة يغلفها الحزن الصادق والأسى العميق .  '''
long_answer_3 = '''  وقد ألقى العقاد هذه القصيدة في حفل تأبين الكاتبة بدار الاتحاد النسائي بالقاهرة في شهر نوفمبر 1941م .  '''
long_answer_4 = '''  الرثاء ، وهو الحديث عن الميت وذكر محاسنه التي كان يحملها في حياته ، وهو فن يشع بالصدق فلا رياء فيه ، والوفاء شعاره فهو فن شعري حمّال للقيم .  '''
long_answer_5 = '''  ولدت مي أو ماري إلياس زيادة - وهذا هو اسمها الحقيقي - في مدينة الناصرة بفلسطين عام ١٨٨٦م لأب لبناني وأم فلسطينية .. وقد تعلمت في مدرسة من مدارس الراهبات ، وظهرت موهبتها الأدبية في زمن مبكر ، وأخذت تكتب في الصحف والمجلات ، وأجادت عدة لغات ساهمت في رُقي تكوينها الأدبي ... ثم جاءت إلى مصر 1908م واستقرت بها وأنشأت عام 1913م صالونها الأدبي الذي كان قبلة لكبار الأدباء واستمر حتى نهاية الثلاثينات وكان ينعقد  كل يوم ثلاثاء برئاسة الشاعر إسماعيل صبري ويحضره كبار الأدباء والمثقفين مثل طه حسين وأحمد شوقي والعقاد وغيرهم .   '''
long_answer_6 = '''  قال عنها أحمد حسن الزيات : " إنها تشارك في كل علم ، وتفيض في كل حديث ، وتختصر للجليس سعادة العمر كله في لفتة أو لمحة أو ابتسامة ، كأن فيها أفضل ما في الرجل وخير ما في المرأة ، فمن كان يسمعها خطيبة ، أو يشهدها محدثة ، كان يحسبها - وقد استدارت على رأسها الأنيق هالة من السحر والفتنة - إحدى بنات جوبيتر التسع ، قد سرقت من أخواتها أسرار فنونهن ، ثم هبطت من فوق جبل البرناس إلى ضفاف النيل ! ".  '''
long_answer_7 = '''  تجربة ذاتية فيها صدق حيث يرثي شاعرنا  -  صادقاً  -  كل الصفات الخِلقية والخُلقية الرائعة المتأصِّلة في الأديبة الراحلة ميّ .  '''
long_answer_8 = '''  عاطفة الحزن الشديد والألم على فراق وفقد الأديبة مي زيادة الممتزجة بالإعجاب والانبهار بصفاتها وسجاياها الرائعة التي قلما تتكرر .  '''

long_answer_9 = '''  ينتمي الشاعر إلى مدرسة الديوان الرومانسية .  '''
long_answer_10 = '''  من غرض الرثاء  - العقاد كان يعترض عليه في بداية حياته لأنه من شعر المناسبات ولا يمت للأدب بصلة ، ولكنه في النهاية غير رأيه واعتبره إذا كان صادق المشاعر ومعبراً عن الواقع دون تكلف فلا بأس به .  '''
long_answer_11 = '''  الرثاء : هو ذكر محاسن المتوفى ، وخصاله الحسنة التي كان يحملها في حياته ، وتعديدها ، وهو من الأغراض الشعرية القديمة التي تتميز بصدق العاطفة ورقة الإحساس والبعد عن التهويل الكاذب  .- أنواعه : رثاء ذاتي - رثاء قبلي - رثاء قومي .- أشهر شعرائه : الخنساء في رثاء أخيها صخر .   '''
long_answer_12 = '''  رثاء العقاد يتميز بالقصد والاعتدال في إظهار الحزن وفيه تركيز واضح حول الصفات العقلية للمرثية ، بينما الرثاء قديماً يلجأ إلى التهويل والمبالغة .  '''
long_answer_13 = '''  السبب :
1 - لأن الشاعر قسمها إلى مقطوعات .
2 - التزم في كل مقطوعة قافية واحدة ، ولم يلتزم عدد التفعيلات في كل بيت .  '''
long_answer_14 = '''  عكست الصور الخيالية مدى الألم والحزن لفقدان مي من خلال ذكر محاسنها ومنزلتها ، فمن الصور التي تؤكد تميزها : " عرشها المنبر " والذي يوحي بما كانت عليه من مكانة ، و" ذكاء كالشهاب " والذي يوحى بما كانت عليه من ذكاء حاد وتوقد ذهن ، و" شيم غر " و" رضيات عذاب " و" جمال قدسي " و" كل هذا في التراب " ونلاحظ أن هذه الصور جاءت في موضعها غير متكلفة وتعكس حسرة الشاعر وألمه وحزنه الشديد .  '''
long_answer_15 = '''  جاءت المحسنات من طباق وجناس وحسن تقسيم قليلة غير متكلفة ومؤدية المعنى الذي يقصده الشاعر .  '''
long_answer_16 = '''  تسود الأبيات مشاعر الحزن الشديد والألم على فراق وفقد الأديبة مي  الممتزجة بالإعجاب والانبهار بصفاتها ، وقد كان للعاطفة أثرها الواضح في اختيار الشاعر للألفاظ الموفقة الموحية بتلك المشاعر مثل : " ولّى كـَوْكـَبَاهُ " التي توحي بالحزن لفقدها ، و " وَيـْـكَ " التي تعبر عن التعجب والغضب ، وعند الإعجاب قال : " عَرْشُـهَا المِنـْبَرُ والحـَـدِيـْثُ الحـُلْوُ والوَجْـهُ السَّـنِـيْ و كـَوْكـَبَاهُ " كلها ألفاظ توحي بالتميز والجمال وتعبِّر عن عاطفة الإعجاب . 
- كما ظهر أثر العاطفة في اختيار الصور المعبِّرة عن الإعجاب مثل التشبيه في : (عَرْشُـهَا المِنـْبَرُ) الذي يعبر عن تمكنها الأدبي ،  والاستعارة في :  (عَرْشُـهَا .. مُسْـتَجِـيبٌ حِيْنَ يُدْعَى) التي تعبر أيضاً عن تمكنها الأدبي ، ومثل كناية في : (الجَـبـِيْنُ الحـُّرُ وَالوَجْـهُ السَّـنِـيْ) :  عن جمالها الأخاذ والإشراق ...إلخ  '''
long_answer_17 = '''  نوّع العقاد في قافية القصيدة وهو مظهر من مظاهر التطوير في موسيقاها وقد اختار قافيته ملاءمة للحالة النفسية .  '''
long_answer_18 = '''  نوّع الشاعر في القوافي ؛ دفعاً للملل والرتابة التي تسببها القافية الموحدة ، وهذا يتفق مع آراء مدرسة الديوان - وهو من أقطابها - والتي تدعو إلى التجديد في شكل ومضمون القصيدة .  '''
long_answer_19 = '''  تحققت الوحدة الفنية (العضوية) ، ويتضح لنا ذلك من الترابط الواضح والبنية المتماسكة والناجمة عن وحدة الفكر ووحدة الشعور والجو النفسي الحزين السائد في الأبيات .  '''
long_answer_20 = '''  بالفعل حيث عاد الشاعر إلى شعر المناسبات وهو الذي كانت ترفضه مدرسة الديوان ؛ فمفهوم الشعر عند جماعة الديوان أن الشعر تعبير عن الحياة كما يحسها الشاعر من خلال وجدانه وليس منه شعر المناسبات والمجاملات .  '''
long_answer_21 = '''  سمات مدرسة الديوان التي ظهرت في النص :
ذاتية التجربة - الوحدة العضوية - وضع عنوان للقصيدة - تقسيم القصيدة إلى مقاطع - تنويع القوافي في القصيدة -ظهور مسحة من الحزن والألم - التأمل في الموت والحياة .  '''
long_answer_22 = '''  تنوعت بين الأساليب الخبرية والإنشائية وإن شاع الإنشاء في مقاطع القصيدة ؛ حتى يثير في القارئ الحزن على مي , ويقرر ما لها من صفات ومحاسن فقدها الناس برحيلها .  '''
long_answer_23 = '''  1 - التأثر بألفاظ القرآن الكريم في قوله : (فـَصْــلَ الخِـطابْ) المتأثر فيه بقول الله تعالى : "وَآتَيْنَاهُ الْحِكْمَةَ وَفَصْلَ الْخِطَابِ".
2 - استخدام بعض الألفاظ التراثية القديمة ، مثل : (ويك) .
3 - استخدم بعض الصور التقليدية مثل : (ذكاء ألمعي كالشهاب) و (شيم غر .. رضيات عذاب).  '''
long_answer_24 = '''  1 - اختيار عنوان للنص تدور حوله الأفكار . 
2 - عدم الالتزام بالقافية الموحدة وتنويعها.
3 - رسم الصور الكلية .
4 - البعد عن المحسنات البديعية المتكلفة .
5 - التجديد في الرثاء .
6 - الوحدة العضوية المتمثلة في وحدة الموضوع ووحدة الجو النفسي .  '''
long_answer_25 = '''  موهوب - مثقف - يحب الجمال والصفات الحسنة ويحزن لفقدها - ويقدر العقول المفكرة وأصحابها .  '''
long_answer_26 = '''  1 - مشاركة المرأة في الحياة الأدبية بقوة .
2 - كثرة المثقفين واتساع الثقافة .
3 - كثرة المحافل والمنتديات الثقافية  
4 - تقدير المثقفين والمثقفات .  '''
long_answer_27 = '''   جاءت قليلة وواضحة وفيها ترابط وتسلسل منطقي .  '''
long_answer_28 = '''   جاءت الألفاظ والتعبيرات سهلة واضحة وخالية من التنافر والتعقيد وملونة بلون عاطفة الحزن والألم والأسى .  '''
long_answer_29 = '''   جاءت جميلة مؤثرة ومعبرة عن حزنه الواضح وفيها صدق وجمع فيها الشاعر بين التصوير الكلي والجزئي من تشبيه واستعارة وكناية ومجاز .  '''
long_answer_30 = '''    '''
long_answer_31 = '''    '''



# النصوص والأسئلة والأجوبة
texts = {
    "إِختِلافُ النَهارِ وَاللَيلِ يُنسي": {
        "text": '''
        إِختِلافُ النَهارِ وَاللَيلِ يُنسي   اُذكُرا لِيَ الصِبا وَأَيّامَ أُنسي
        وَصِفا لي مُلاوَةً مِن شَبابٍ       صُوِّرَت مِن تَصَوُّراتٍ وَمَسِّ
        عَصَفَت كالصَّبَا اللَعوبِ وَمَرَّت   سِنَةً حُلوَةً وَلَذَّةُ خَلسِ
        وَسَلا مِصرَ هَل سَلا القَلبُ عَنها   أَو أَسا جُرحَهُ الزَمانَ المُؤَسّي
        كُلَّما مَرَّتِ اللَيالي عَلَيهِ     رَقَّ وَالعَهدُ في اللَيالي تُقَسّي
        مُستَطارٌ إِذا البَواخِرُ رَنَّت     أَوَّلَ اللَيلِ أَو عَوَت بَعدَ جَرسِ
        راهِبٌ في الضُلوعِ لِلسُفنِ فَطنُ     كُلَّما ثُرنَ شاعَهُنَّ بِنَقسِ
        يا اِبنَةَ اليَمِّ ما أَبوكِ بَخيلٌ    ما لَهُ مولَعاً بِمَنعٍ وَحَبسِ
        أَحرامٌ عَلى بَلابِلِهِ الدَوحُ      حَلالٌ لِلطَيرِ مِن كُلِّ جِنسِ
        كُلُّ دارٍ أَحَقُّ بِالأَهلِ إِلّا    في خَبيثٍ مِنَ المَذاهِبِ رِجسِ
        نَفسي مِرجَلٌ وَقَلبي شِراعٌ      بِهِما في الدُموعِ سيري وَأَرسي
        وَاِجعَلي وَجهَكِ الفَنارَ وَمَجراكِ    يَدَ الثَغرِ بَينَ رَملٍ وَمَكسِ
        وَطَني لَو شُغِلتُ بِالخُلدِ عَنهُ    نازَعَتني إِلَيهِ في الخُلدِ نَفسي
        وَهَفا بِالفُؤادِ في سَلسَبيلٍ      ظَمَأٌ لِلسَوادِ مِن عَينِ شَمسِ
        شَهِدَ اللَهُ لَم يَغِب عَن جُفوني     شَخصُهُ ساعَةً وَلَم يَخلُ حِسّي
        ''',
        "questions": {
            "ما الذي يُنسيه إِختِلافُ النَهارِ وَاللَيلِ؟": "يُنسي الصِبا وأيام الأُنس.",
            "ما هو شعور الشاعر تجاه الشباب؟": "الشاعر يصف شبابه بأنه مليء بالتصورات واللذة التي مرت كسنة حلوة.",
            "ما هو موقف الشاعر من مصر؟": "الشاعر لا يستطيع نسيان مصر حتى ولو مرت السنوات.",
            "ماذا يعني بعبارة 'نَفسي مِرجَلٌ وَقَلبي شِراعٌ'؟": "الشاعر يعبر عن حبه وحنينه لمصر بهذه العبارة.",
            "كيف يصف الشاعر مشاعره تجاه السفن؟": "الشاعر يشعر بالفزع والقلق كلما سمع صوت السفن، فهي تثير في نفسه ذكريات وحنين."
        },
        "sections": {
            "section1": {
                "linguistics": "توضيح لغوي للمقطوعة الأولى.",
                "explanation": "شرح للمقطوعة الأولى.",
                "taste": "تذوق أدبي للمقطوعة الأولى.",
                "reasoning": "تعليل للمقطوعة الأولى."
            },
            "section2": {
                "linguistics": "توضيح لغوي للمقطوعة الثانية.",
                "explanation": "شرح للمقطوعة الثانية.",
                "taste": "تذوق أدبي للمقطوعة الثانية.",
                "reasoning": "تعليل للمقطوعة الثانية."
            },
            "section3": {
                "linguistics": "توضيح لغوي للمقطوعة الثالثة.",
                "explanation": "شرح للمقطوعة الثالثة.",
                "taste": "تذوق أدبي للمقطوعة الثالثة.",
                "reasoning": "تعليل للمقطوعة الثالثة."
            },
            "section4": {
                "linguistics": "توضيح لغوي للمقطوعة الرابعة.",
                "explanation": "شرح للمقطوعة الرابعة.",
                "taste": "تذوق أدبي للمقطوعة الرابعة.",
                "reasoning": "تعليل للمقطوعة الرابعة."
            }
        }
    },
    "قصيدة العقاد في رثاء مي زيادة": {
        "text": '''

أَيْنَ فِي المَحْفِلِ  مَيٌّ يَا صِحَابْ ؟
عَوَّدَتْنَا هَا هـُنَا فـَصْـلَ الخِطابْ
عَرْشُـهَا المِنْبَرُ مَرْفـُوعُ الجَنَابْ
مُسْـتَجِيبٌ حِيْنَ يُدْعَى مُسْتَجَابْ
أَيْنَ فِي المَحْفِلِ مَيٌّ يَا صِحَابْ ؟

 سَائِلـُوا النـُّخـْبَة مِنْ رَهـْطِ النـَّدِيْ
أَيْنَ مَيٌّ ؟ هَلْ عَلِمْتُمْ أَيْنَ مَــــيْ ؟
الحـَـدِيـْثُ الحـُلْوُ وَاللَّحْـنُ الشَّجـِيْ
وَالجَـبـِيْنُ الحـُّرُ وَالوَجْـهُ السَّـنِـيْ
أَيـْنَ وَلـَّىْ كـَوْكـَبَاهُ ؟ أَيْنَ غـَابْ ؟

شِيـَمٌ غـُرٌّ رَضـِيـَّاتٌ عِــذابْ
وحـِجـَى يَنْفـُـذُ بِالرَّأْيِ الصَّوَابْ
وَذَكَاءٌ أَلْـمَــعـِيٌّ كـَالشـِّهـَابْ
وَجَــــمَــالٌ قـُدْسِـيٌّ لا يُعَابْ
كُلُّ هَذَا فِي التُّرَابْ؟ آهِ مِنْ هَذَا التُّرَابْ

وَيـْـكَ مَا أَنْـتَ بـِــرَادٍّ ما لديك
أَضْـيَعُ الآمَالِ مَا ضَاعَ عـَلَيـَكْ
مَجْـــدُ مَيٍّ غـَيْـرُ مَوْكُوْلٍ إِلَيْكَ
مجد مي خالص من قبضتيكْ
وَلَهَا مِـنْ فـَضْلِهَا أَلْفُ ثـَوَابْ


        ''',
        "questions": {
            "من الشاعر؟": "عباس محمود العقاد.",
            "عنوان النص؟": "أَيْنَ فِي المَحْفِلِ  مَيٌّ يَا صِحَابْ ؟",
            "التعريف بالشاعر؟": long_answer_1,
            "مناسبة النص؟": long_answer_2,
            "متي القي العقاد هذة القصيدة؟": long_answer_3,
            "ما الغرض الشعري من النص؟": long_answer_4,
            "التعريف بالمرثية مي؟": long_answer_5,
            "ماذا قال كبار الأدباء عن (مي)؟": long_answer_6,
            "نوع التجربة؟": long_answer_7,
            "ما العاطفة المسيطرة على الشاعر؟": long_answer_8,

            "إلي أي المدارس الأدبية ينتمي هذا النص ؟": long_answer_9,
            "من أي أغراض الشعر هذا النص ؟  وما موقف العقاد منه ؟": long_answer_10,
            "ما المقصود بالرثاء ؟ وما أنواعه ؟ وما أشهر شعرائه ؟": long_answer_11,
            "فيمَ يختلف رثاء العقاد عن الرثاء قديماً ؟": long_answer_12,
            "لماذا تمثل القصيدة نموذجاً للتجديد في الشعر وبخاصة شعر الرثاء ؟": long_answer_13,
            "ما الذي عكسته الصور الخيالية في النص ؟  أو كيف وظف الشاعر الصور الخيالية في النص ؟": long_answer_14,
            "ما دور المحسنات البديعية في النص ؟": long_answer_15,
            "ما أثر العاطفة في التعبير؟": long_answer_16,
            " ما مظاهر التطوير في موسيقا القصيدة عند العقاد ؟": long_answer_17,
            "علل : تنويع الشاعر لقوافي قصيدته .": long_answer_18,
            "ما نصيب الوحدة الفنية (العضوية) في الأبيات ؟": long_answer_19,
            "يقال أن الشاعر خالف مبادئ مدرسة الديوان على الرغم من أنه من أقطابها . علل .": long_answer_20,
           
            "ما سمات مدرسة الديوان التي ظهرت في النص ؟": long_answer_21,
            "ما نوع الأساليب في الابيات؟ ": long_answer_22,
            "ما  ملامح المحافظة على القديم في النص ؟ ": long_answer_23,
            "ما ملامح التجديد في النص ؟": long_answer_24,
            "ما ملامح  ملامح شخصية العقاد في النص ؟": long_answer_25,
            "ما أثر البيئة في النص ؟": long_answer_26,
            "كيف جاءت فكر الشاعر في النص؟": long_answer_27,
            "بم تتميز الالفاظ والتعبيرات في النص؟": long_answer_28,
            "كيف عبرت الصور الخيالية عن عاطفة الشاعر؟": long_answer_29,
            "": long_answer_30,
            "": long_answer_31,


        },
        "sections": {
            "section1": {
                "linguistics": "توضيح لغوي للمقطوعة الأولى.",
                "explanation": "شرح للمقطوعة الأولى.",
                "taste": "تذوق أدبي للمقطوعة الأولى.",
                "reasoning": "تعليل للمقطوعة الأولى."
            },
            "section2": {
                "linguistics": "توضيح لغوي للمقطوعة الثانية.",
                "explanation": "شرح للمقطوعة الثانية.",
                "taste": "تذوق أدبي للمقطوعة الثانية.",
                "reasoning": "تعليل للمقطوعة الثانية."
            },
            "section3": {
                "linguistics": "توضيح لغوي للمقطوعة الثالثة.",
                "explanation": "شرح للمقطوعة الثالثة.",
                "taste": "تذوق أدبي للمقطوعة الثالثة.",
                "reasoning": "تعليل للمقطوعة الثالثة."
            },
            "section4": {
                "linguistics": "توضيح لغوي للمقطوعة الرابعة.",
                "explanation": "شرح للمقطوعة الرابعة.",
                "taste": "تذوق أدبي للمقطوعة الرابعة.",
                "reasoning": "تعليل للمقطوعة الرابعة."
            }
        }
    }
}

# HTML template
template = '''
<!doctype html>
<html lang="ar">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="manifest" href="/manifest.json">

    <title>نصوص أدبية</title>
    <style>
        body { font-family: Arial, sans-serif; direction: rtl; background-color: #8b8b8b; margin: 0; padding: 0; }
        .container { width: 85%; margin: 50px auto; padding: 20px; background: #fff; border-radius: 8px; box-shadow: 0 0 10px rgba(0,0,0,0.1); }
        .title { font-size: 30px; font-weight: bold; margin-bottom: 10px; text-align: center; box-shadow: 3px 3px 13px #b5b097; margin: 30px 100px; border-radius: 8px; padding: 20px 0; }
        .text { white-space: pre-line; font-size:32px; line-height: 2em; text-align: center; margin: 30px 10px; background-color: aliceblue; border-radius: 20px 85px; }
        .buttons { margin-top: 20px; text-align: center; }
        .btn { display: inline-block; padding: 10px 15px; margin: 5px; border: none; border-radius: 5px; color: #fff; cursor: pointer; box-shadow: 3px 3px 8px #14190c; transition: 0.2s ease; }
        .btn:hover { box-shadow: 1px 1px 8px #14190c; }
        .btn-primary { background-color: #007bff; }
        .btn-secondary { background-color: #6c757d; margin: 10px 30px; padding: 10px 35px; }
        .icon { cursor: pointer; padding: 10px; margin: 20px 20px; border: none; border-radius: 5px; background-color: #eee; box-shadow: 3px 3px 8px #14190c; transition: 0.2s ease; }
        .icon:hover { background-color: #ddd; box-shadow: 1px 1px 8px #14190c; }
        .section { display: none; }
        .section.active { display: block; }
        .icon-container { margin-bottom: 20px; text-align: center; margin: 15px; background-color: #e8e9e9; border-radius: 10px; }
        .text_0 { font-size: 25px; text-align: center; margin: 30px 10px 30px 10px; background-color: aliceblue; border-radius: 6px; padding: 15px; }
        .info { font-size: 22px; margin: 25px 10px 40px 10px; padding: 20px; background-color: aliceblue; border-radius: 10px; line-height: 37px; }
        .selected_text { padding: 8px; border-radius: 5px; width: 25%; margin: 10px 15px; }
        .text_1 { border-radius: 8px 25px; text-align: center; font-size: 34px; color: #00fff3; background-color: #3e0000; padding: 25px 18px; width: 55%; margin: 50px auto 0 auto; transition: 0.2s ease; }
        .text_1:hover { border-radius: 25px 8px; color: #c3e400; background-color: #090d31 }
        .question { padding: 8px; border-radius: 5px; width: 25%; margin: 10px 15px; }
        .question-form h3 { margin: 30px 15px 0 15px;}
        .form_1 { text-align: center; }
        .form_2 { margin-bottom: 20px;}
        .answer p { white-space: pre-line; }

        /* لتحديد أن الجسم (body) يغطي كامل الشاشة */
html, body {
  height: 100%;
  margin: 0;
}

body {
  display: flex;
  flex-direction: column;
  justify-content: space-between; /* للتأكد من أن الفوتر يكون في الأسفل */
}

/* للمحتوى الرئيسي */
.main-content {
  flex-grow: 1; /* يجعل المحتوى الأساسي يأخذ المساحة المتاحة بالكامل قبل الفوتر */
}

.footer_down {
  display: flex;
  justify-content: space-around;
  align-items: center;
  padding: 5px 10px;
  border-top: 2px solid #152f2d;
  border-radius: 25px 25px 0 0;
  background-color: #160606; /* يمكنك تحديد لون الخلفية إذا رغبت */
}

.by h3 {
  font-size: 1.3em;
  color: #00f1ff;
  font-family: Arial, Helvetica, sans-serif;
}

.by h3 a {
  color: #a6ea97;
}

.footer-title {
  color: #c3e400;
  font-size: 1.3em;
  font-weight: 600;
}

.footer-title span {
  color: #e0fffc;
}

        

        @media (max-width: 835px) {
            .text_1 {
                font-size: 26px;
                width: 65%;
            }
            .selected_text {
                width: 40%;
            }
            .btn {
                padding: 10px 25px;
            }
            .question {
                width: 40%;
            }
        }

        @media (max-width: 700px) {
            .title {
                margin: 30px 65px;
            }
            .text_1 {
                font-size: 23px;
                width: 75%;
            }
        }

        @media (max-width: 600px) {
            .title {
                margin: 30px 65px;
            }
        }

        @media (max-width: 500px) {
            .title {
                margin: 30px 45px;
            }
            .text_1 {
                width: 73%;
            }
            .text {
                border-radius: 15px 50px;
                line-height: 1.6em;
                font-size: 30px;
                padding: 0 12px;
            }
            .selected_text {
                width: 50%;
            }
            .question {
                width: 50%;
            }
            .by h3 {
                font-size: 1em;
            }
            .footer-title {
                font-size: 1em;
            }
        }

        @media (max-width: 430px) {
            .text {
                font-size: 27px;
            }
            .btn {
                padding: 10px 12px;
            }
            .selected_text {
                width: 55%;
            }
            .ask {
                padding: 10px 25px;
            }
            .by h3 {
                font-size: 0.9em;
            }
            .footer-title {
                font-size: 0.9em;
            }
        }

        @media (max-width: 385px) {
            .title {
                font-size: 26px;
                margin: 30px 15px;
            }
            .text_1 {
                font-size: 21px;
                width: 82%;
            }
            .text {
                font-size: 24px;
                margin-right: 0;
                margin-left: 0;
            }
            .text_0 {
                font-size: 22px;
            }
        }

        @media (max-width: 365px) {
            .title {
                font-size: 24px;
                margin: 30px 15px;
            }
            .btn {
                padding: 10px 12px;
            }
            .text {
                font-size: 24px;
                margin-right: 0;
                margin-left: 0;
            }
            .selected_text {
                width: 52%;
            }
            .question {
                width: 53%;
            }
            .ask {
                padding: 10px 23px;
            }
            .audio { 
                width: 250px;
            }
            .by h3 {
                font-size: 0.75em;
            }
            .footer-title {
                font-size: 0.75em;
            }
        }

        @media (max-width: 335px) {
            .title {
                font-size: 22px;
                margin: 30px 15px;
            }
            .btn {
                padding: 10px 8px;
            }
            .text_1 {
                font-size: 20px;
                width: 79;
            }
            .selected_text {
                width: 50%;
            }
            .question {
                width: 45%;
            }
            .ask {
                padding: 10px 23px;
            }
            .text_0 {
                font-size: 20px;
            }
            .text {
                font-size: 23px;
            }
        }


    </style>
</head>
<body>
    <div class="container">
        <div class="title"> 👑 نصوص أدبية 👑 </div>
        <form method="post" action="/" class="form_1">
            <select name="selected_text" class="selected_text">
                <option value="">اختر نصاً</option>
                {% for title in texts.keys() %}
                    <option value="{{ title }}">{{ title }}</option>
                {% endfor %}
            </select>
            <button type="submit" class="btn btn-primary">عرض النص</button>
        </form>
        {% if selected_text_title %}
            <h2 class="text_1">{{ selected_text_title }}</h2>
            <div class="text">{{ selected_text_content }}</div>
            <div class="icon-container">
                <button class="icon" onclick="showSection('section1')">المقطوعة الأولى</button>
                <button class="icon" onclick="showSection('section2')">المقطوعة الثانية</button>
                <button class="icon" onclick="showSection('section3')">المقطوعة الثالثة</button>
                <button class="icon" onclick="showSection('section4')">المقطوعة الرابعة</button>
            </div>
            <div id="section1" class="section">
                <div class="text_0">
                    <p>أين في المحفل "مي" يا صحابْ ؟</p>
                    <p>عودتنا ها هنا فصل الخطاب</p> 
                    <p>عرشها المنبر مرفوع الجناب</p>
                    <p>مستجيب حين يُدعى مستجاب</p>
                    <p>أين في المحفل "مي" يا صحاب ؟</p>
                </div>
                <div class="buttons">
                    <button class="btn btn-secondary" onclick="showInfo('section1', 'linguistics')">اللغويات</button>
                    <button class="btn btn-secondary" onclick="showInfo('section1', 'explanation')">الشرح</button>
                    <button class="btn btn-secondary" onclick="showInfo('section1', 'taste')">التذوق</button>
                </div>

                <div id="section1-info" class="info"></div>
            </div>
            <div id="section2" class="section">
                <div class="text_0">
                    <p> سَائِلـُوا النـُّخـْبَة مِنْ رَهـْطِ النـَّدِيْ</p>
                    <p>
                    أَيْنَ مَيٌّ ؟ هَلْ عَلِمْتُمْ أَيْنَ مَــــيْ ؟
                    </p>
                    <p>
                    الحـَـدِيـْثُ الحـُلْوُ وَاللَّحْـنُ الشَّجـِي
                    ْ</p>
                    <p>
                    وَالجَـبـِيْنُ الحـُّرُ وَالوَجْـهُ السَّـنِـيْ
                    </p>
                    <p>
                    أَيـْنَ وَلـَّىْ كـَوْكـَبَاهُ ؟ أَيْنَ غـَابْ ؟ ؟
                    </p>
                </div>
                <div class="buttons">
                    <button class="btn btn-secondary" onclick="showInfo('section2', 'linguistics')">اللغويات</button>
                    <button class="btn btn-secondary" onclick="showInfo('section2', 'explanation')">الشرح</button>
                    <button class="btn btn-secondary" onclick="showInfo('section2', 'taste')">التذوق</button>
                </div>
                <div id="section2-info" class="info"></div>
            </div>
            <div id="section3" class="section">
                <div class="text_0">
                    <p>شِيـَمٌ غـُرٌّ رَضـِيـَّاتٌ عِــذابْ</p>
                    <p>وحـِجـَى يَنْفـُـذُ بِالرَّأْيِ الصَّوَابْ</p>
                    <p>وَذَكَاءٌ أَلْـمَــعـِيٌّ كـَالشـِّهـَابْ</p>
                    <p>وَجَــــمَــالٌ قـُدْسِـيٌّ لا يُعَابْ</p>
                    <p>كُلُّ هَذَا فِي التُّرَابْ؟ آهِ مِنْ هَذَا التُّرَابْ ؟</p>
                </div>
                <div class="buttons">
                    <button class="btn btn-secondary" onclick="showInfo('section3', 'linguistics')">اللغويات</button>
                    <button class="btn btn-secondary" onclick="showInfo('section3', 'explanation')">الشرح</button>
                    <button class="btn btn-secondary" onclick="showInfo('section3', 'taste')">التذوق</button>
                </div>
                <div id="section3-info" class="info"></div>
            </div>

                        <div id="section4" class="section">
                <div class="text_0">
                    <p>وَيـْـكَ مَا أَنْـتَ بـِــرَادٍّ ما لديك</p>
                    <p>أَضْـيَعُ الآمَالِ مَا ضَاعَ عـَلَيـَكْ</p>
                    <p>مَجْـــدُ مَيٍّ غـَيْـرُ مَوْكُوْلٍ إِلَيْكَ</p>
                    <p>مجد مي خالص من قبضتيكْ</p>
                    <p>وَلَهَا مِـنْ فـَضْلِهَا أَلْفُ ثـَوَابْ</p>
                </div>
                <div class="buttons">
                    <button class="btn btn-secondary" onclick="showInfo('section4', 'linguistics')">اللغويات</button>
                    <button class="btn btn-secondary" onclick="showInfo('section4', 'explanation')">الشرح</button>
                    <button class="btn btn-secondary" onclick="showInfo('section4', 'taste')">التذوق</button>
                </div>
                <div id="section4-info" class="info"></div>
            </div>

            <div class="question-form">
                <h3>اسأل عن النص:</h3>
                <form method="post" action="/ask_question" class="form_2">
                    <input type="text" name="question" class="question" placeholder="أدخل سؤالك هنا" required>
                    <input type="hidden" name="selected_text" value="{{ selected_text_title }}">
                    <button type="submit" class="btn btn-primary ask">اسأل</button>
                </form>
                {% if answer_text %}
                    <div class="answer">
                        <h4>الإجابة النصية:</h4>
                        <p>{{ answer_text }}</p>
                        <audio controls class="audio">
                            <source src="{{ answer_audio_url }}" type="audio/mp3">
                            Your browser does not support the audio element.
                        </audio>
                    </div>
                {% endif %}
            </div>
        {% endif %}
    </div>

    
    <div class="footer_down">

      <div class="by">
        <h3>Created by <a href="https://wa.me/201068639084" target="_blank"> Hazem Gamal </a></h3>
      </div>

      <p class="footer-title">Copyrights @ <span> <span>2024</span></span></p>

    </div>

    
    <script>
        function showSection(sectionId) {
            document.querySelectorAll('.section').forEach(function(section) {
                section.classList.remove('active');
            });
            document.getElementById(sectionId).classList.add('active');
        }
        function showInfo(sectionId, type) {
            var info = {
                'section1': {
                    'linguistics': 'توضيح لغوي للمقطوعة الأولى￼ - المحفل : المجلس ، مجتمع القوم ج محافل - صحاب : أصدقاء ، رفاق م صاحب - عودتنا : جعلتها عادة ملازمة لنا - ها : حرف تنبيه - هنا : ظرف مكان للقريب × هناك - ها هنا : أي صالون مي الأدبي - فصل الخطاب : القول الصواب الواضح القاطع ، الفصاحة × القول الخطأ ، الرَّكاكَة - عرش : كرسي الملك ، والمقصود : مكان جلوسها أو مقامها ج عروش ، أعراش - المنبر : المنصّة ، مكان وقوف الإمام للخطابة ج المنابر - مرفوع : عالٍ × متدنٍ ، وضيع ، موضوع - الجناب : أي المنزلة والمكانة ج أجنبة - مرفوع الجناب : أي معتزاً مفتخراً بها - مستجيب : أي عرش البيان والفصاحة يستجيب لها ، مطيع × ممتنع - حين : وقت ج أحيان ج ج أحايين - يدعى : يُنادى ويُطلب × يُصرَف ، يُنحّى - مستجاب : أي يستجيب الناس لخطابها ، مطاع × مرفوض .',
                    'explanation': ` يسأل شاعرنا الرفاق في حزن وألم وحسرة عن الأديبة الراحلة (مي زيادة) - غير مصدق - أين اختفت ، وهي التي اعتاد صفوة الأدباء والمثقفين سماع سحر بيانها ، وعذوبة كلماتها ، ورأيها القاطع المقنع الصائب دائماً ، ولما لا وهي الأديبة المفوهة ذات المكانة العالية التي جعلت اللغة طوع بنانها فأطاعتها اللغة فامتلكت ناصية البيان فأبهرت الكل بسحر بيانها .. ثم يعود شاعرنا سائلاً في حسرة مرة أخرى الرفاق غير مصدق عن غياب مي المفاجئ وكأنه ينكر اختفاءها ..`,
                    'taste': `￼(أَيْنَ فِي المَحْفِلِ مَيٌّ يَا صِحَابْ ؟) : كناية عن افتقاد الشاعر الشديد للأديبة مي زيادة ، وسر جمال الكناية : الإتيان بالمعنى مصحوباً بالدليل عليه في إيجاز وتجسيم .
￼(أَيْنَ فِي المَحْفِلِ مَيٌّ ؟) : أسلوب إنشائي / استفهام غرضه : إظهار الحزن والألم والتحسر والصدمة واللوعة  .
￼(أَيْنَ فِي المَحْفِلِ مَيٌّ ؟) : أسلوب قصر بتقديم الجار والمجرور (في المحفل) على المبتدأ (مي) ؛ للتخصيص والتوكيد .
￼(يَا صِحَابْ) : أسلوب إنشائي / نداء غرضه : التنبيه والتحسر.
￼(عَـوَّدَتْنَا هَا هـُنَا فـَصْــلَ الخِـطابْ) : كناية عن تميزها الأدبي ورجاحة عقلها وفكرها ؛ فهي الأديبة الملهمة للآخرين .  .
￼(عَـوَّدَتْنَا) : استخدام الفعل الماضي يفيد الثبوت والتحقق من قدرتها البيانية المبهرة ، وتضعيف الواو في الفعل للدلالة على استمرارية تميز مي في مجلسها ، وأثرها المميز القوي في نفوس الحاضرين .
￼(هَا هـُنَا) : استخدام (ها) للتنبيه ، واسم الإشارة (هنا) للقريب ؛ ليدل على ألفة مجلسها ، وقربه من النفوس .
￼(فـَصْــلَ الخِـطابْ) : اقتباس من القرآن الكريم مأخوذ من قول الله تعالى في سورة (ص) : " وَآتَيْنَاهُ الْحِكْمَةَ وَفَصْلَ الْخِطَابِ ".
￼(عَرْشُـهَا) : استعارة تصريحية حيث صور الشاعر مكانة مي الأدبية المميزة بالعرش ، وسر جمال الصورة : التوضيح ، وتوحي الصورة بأنها ملكة متوجة على عرش الأدب.
￼(عَرْشُـهَا المِنـْبَرُ) : تشبيه حيث شبه المنبر بالعرش وسر جمال الصورة : التوضيح ، وتوحي الصورة بفصاحتها الواضحة وتمكنها الأدبي العظيم ؛ فهي ملكة الأدب المتوَّجة ، والخيال في الصورتين السابقتين خيال مركب ، حيث جعل كلمة " عرش " مشبهاً به في الصورة الأولى ، ومشبهاً في الصورة الثانية لتقوية الخيال .
￼(عَرْشُـهَا المِنـْبَرُ) : أي أن المنبر (أي صدر المكان) هو مكانها اللائق بها للدلالة على تمكنها من البيان والخطابة وبالتالي سمو مكانتها الأدبية وتميزها ؛ فهي في صدارة الأدباء والأديبات التي تتجه إليها الأنظار .
￼(عَرْشُـهَا المِنـْبَرُ) : أسلوب قصر بتعريف الطرفين المبتدأ (المنبر) والخبر (عرشها) ؛ للتأكيد والتخصيص على أنها ملكة الأدب المتوجة التي لها الصدارة .
￼(المِنـْبَرُ) : مجاز مرسل عن فصاحتها الأدبية ، علاقته : المحلية ، وسر جمال المجاز : الدقة والإيجاز . .
￼(مَرْفـُوعُ الجَـنَابْ) : كناية عن سمو مكانة مي الأدبية ، وسر جمال الكناية : الإتيان بالمعنى مصحوباً بالدليل عليه في إيجاز وتجسيم .
￼(الخِـطابْ - المِنـْبَرُ) : محسن بديعي / مراعاة نظير تثير الذهن .
￼(عَرْشُـهَا .. مُسْـتَجِـيبٌ حِيْنَ يُدْعَى) : استعارة مكنية حيث صوّر العرش بإنسان يستجيب حين يُدعى ، وسر جمال الصورة : التشخيص ، وتوحي الصورة بالتمكن الأدبي .
￼(حِيْنَ يُدْعَى) : إطناب بالاعتراض للاحتراس
￼(يُدْعَى) : بناء الفعل للمجهول إيجاز بالحذف ، والتعبير بـ(يدعى) يدل على التلبية السريعة والتمكن الأدبي .
￼(مُسْـتَجِـيبٌ - مُسْـتَجَابْ) : محسن بديعي / طباق يبرز المعنى ويوضحه ويقويه بالتضاد . 
￼(مُسْـتَجِـيبٌ - مُسْـتَجَابْ) : محسن بديعي / جناس اشتقاقي ناقص يعطي جرساً موسيقياً وإيقاعاً محبباً للأذن .
￼(أَيْنَ مَيٌّ ؟) : ختم الشاعر مقطوعته الأولى بتكرار للسؤال الذي بدأ به قصيدته ؛ ليؤكد انفعاله الشديد وحسرته وألمه وصدمته وكأنه يسأل عن مكان اختفائها لا مكان موتها ؛ فهو ينكر موتها ولا يتصوره ، أو ربما عدم التصديق بأنها رحلت فالفاجعة بفقدها كبيرة .`,
                },
                'section2': {
                    'linguistics': 'سائلوا : اسألوا بكثرة × أجيبوا - النخبة : الصفوة ج نُخب ، نُخبات × العامة - رهط : جماعة من الناس من ثلاثة إلى العشرة ، صُحبة ج أرْهُطٌ ، وأرْهاط - الندي : النادي ، مجلس القوم ومكان اجتماعهم - علمتم : عرفتم × جهلتم - الحديث : الكلام ج الأحاديث × الصمت - الحلو : السائغ الطيب × المر ، الكريه - اللحن : النغم ، الإيقاع  ج ألحان ، لحون - الشجي : الحزين الكئيب ، والمقصود باللحن الشجي : المؤثر - الجبين : ما فوق الصدغ يميناً أو يساراً ج أجبن ، أجبنة ، جُبن ، والمقصود بالجبين الحر : الجبين الصافي - الجبهة : ما بين الحاجبين إلى الناصية ج جباه وجبهات - الوجه ج وجوه ، أوجه - السني : الوضاء ، المشرق ، المنير × المظلم ، العابس - ولى : انصرف ، أدبر ، غاب × أقبل ، بقي ، دام - كوكباه : أي ذات الشاعرة ج كواكب - غاب : أفل ، اختفى × آب ، عاد ، أطل .',
                    'explanation': `مازال شاعرنا غير مصدق أن مي فارقت الحياة ورحلت عن عالمنا بعد أن غيّبها الموت فيسأل - ملحاً في السؤال - في حزن وألم وحيرة الصفوة من الأدباء الذين كانوا رواد مجلسها أين ميّ هل تعلمون أين مكانها ؟! أين صاحبة الحديث العذب الجميل والصوت الساحر المؤثر الذي يخلب الألباب والجبين البراق والوجه المشرق الوضاء ؟!! وفي النهاية يصرخ العقاد متسائلاً في حيرة عن مكان مي الكوكب الذي كان يشع بنوره على من حوله .`,
                    'taste': `
￼(سَائِلـُوا النـُّخـْبَة) :أسلوب إنشائي / أمر غرضه : الالتماس ويوحي بالتحسر والألم على فقدها .
￼(سَائِلـُوا النـُّخـْبَة) : تعبير جميل يدل على مكانة ميّ الرفيعة فمن يعرفها ويهتم بأمرها هم صفوة وفطاحل الأدب ، وجاءت (النخبة) معرفة للتعظيم .
￼(رَهـْطِ النـَّدِيْ) : كناية عن كثرة رواد مجلسها ، وتأثرهم بحديثها العذب الجميل ، وإضافة (رهط) إلى (الندي) للتخصيص .
￼(أَيْنَ مَيٌّ ؟) : أسلوب إنشائي / استفهام غرضه : إظهار الحزن والألم والتحسر والصدمة واللوعة  .
￼(هَلْ عَلِمْتُمْ أَيْنَ مَيْ ؟) : أسلوب إنشائي / استفهام غرضه : إظهار الحزن والألم والتحسر والصدمة واللوعة  .
￼(الحـَـدِيـْثُ الحـُلْوُ) : إيجاز بحذف المبتدأ ، والتقدير : (هي الحديث الحلو)  .
￼(الحـَـدِيـْثُ الحـُلْوُ) : تشبيه حيث شبه مي بالحديث اللذيذ ، وسر جمال الصورة : التوضيح ، وتوحي الصورة بمتعة الاستماع إليها فحديثها الخلاب يأسر الألباب .
￼(الحـَـدِيـْثُ الحـُلْوُ) : استعارة مكنية حيث صوّر حديث مي الساحر بفاكهة أو بشراب حلو الطعم ، وسر جمال الصورة : التجسيم ، وتوحي الصورة بشدة الإعجاب بحديثها الخلاب الذي يأسر الألباب ، والخيال في الصورتين السابقتين خيال مركب ، حيث جعل كلمة " الحديث " مشبهاً به في الصورة الأولى ، ومشبهاً في الصورة الثانية لتقوية الخيال .
￼(اللَّحْـنُ الشَّجـِيْ) : استعارة تصريحية ، حيث صوّر الشاعر صوت مي الخلاب باللحن الشجي ، حيث حذف المشبه وصرح بالمشبه به ، وسر جمال الصورة : التوضيح ، وتوحي الصورة  بعذوبة وروعة كلامها  .
￼(الحـُلْوُ - اللَّحْـنُ ) : محسن بديعي / جناس ناقص يعطي جرساً موسيقياً وإيقاعاً محبباً للأذن .
￼(الجَـبـِيْنُ الحـُّرُ وَالوَجْـهُ السَّـنِـيْ) : كناية عن الجمال الأخاذ والإشراق .
￼(الوَجْـهُ السَّـنِـيْ) : استعارة مكنية حيث صوّر وجه مي بالشمس المشرقة ؛ لتوضيح جمالها الساحر .
￼(الجَـبـِيْنُ - الوَجْـهُ) : محسن بديعي / مراعاة نظير تثير الذهن .
￼(الحـَـدِيـْثُ الحـُلْوُ وَاللَّحْـنُ الشَّجـِيْ) ، (وَالجَـبـِيْنُ الحـُّرُ وَالوَجْـهُ السَّـنِـيْ) : محسن بديعي / حسن تقسيم يعطي جرساً موسيقياً وإيقاعاً محبباً للأذن .
￼(الحـَـدِيـْثُ الحـُلْوُ وَاللَّحْـنُ الشَّجـِيْ ، وَالجَـبـِيْنُ الحـُّرُ وَالوَجْـهُ السَّـنِـيْ) : إطناب عن طريق التفصيل بعد الإجمال في (مي) .
￼(الحـَـدِيـْثُ .. وَاللَّحْـنُ .. وَالجَـبـِيْنُ .. وَالوَجْـهُ ..) : العطف بالواو يفيد تعدد وتنوع صفاتها الرائعة التي تفردت بها مي زيادة .
￼(أَيـْنَ وَلـَّىْ كـَوْكـَبَاهُ ؟ أَيْنَ غـَابْ ؟) :أسلوب إنشائي / استفهام غرضه : إظهار الحزن والألم والتحسر والصدمة واللوعة  .
￼(ولّى كـَوْكـَبَاهُ) : استعارة مكنية حيث صور الشاعر الكوكب بإنسان يرحل ، وسر جمال الصورة : التشخيص ، وتوحي الصورة الافتقاد الشديد لها .
￼(كـَوْكـَبَاهُ) : استعارة تصريحية حيث صور الشاعر ميّ  بالكوكب ، وسر جمال الصورة : التوضيح ، وتوحي الصورة بجمالها ومكانتها السامية السامقة .
￼(كـَوْكـَبَاهُ) : أسلوب إنشائي / نداء " ندبة " ، وغرضه التفجع وإظهار الحسرة ، ويوحي بالألم والمعاناة .
￼(كـَوْكـَبَاهُ) : أصلها (كوكب) ، وقد استعار الشاعر الكلمة للأديبة الراحلة بجامع السمو والشهرة ، ثم ألحق بها الألف والهاء - التي تعرف بـ(هاء السكْت) على سبيل النُّدبة - وهي أحد أساليب النداء ، والأصل في هذا الأسلوب أن تسبق الكلمة بـ(وا) وتلحق بها ألف زائدة ، وقد تلحقها الهاء نحو : وا إسلاماه ، وا معتصماه ، وقد جاء الأسلوب في النص بدون (وا).
￼(أَيْنَ غـَابْ ؟) :أسلوب إنشائي / استفهام غرضه : إظهار الحزن والألم والتحسر والصدمة واللوعة  .
￼(وَلـَّىْ - غـَابْ) : إطناب بالترادف ؛ للتأكيد على شدة الحيرة والألم لفراق مي .`,
                },
                'section3': {
                    'linguistics': 'شيم : أخلاق م شيمة - غر : بيضاء ، والمراد : حميدة ، كريمة ، مميزة م غراء ، مذكرها : أغر - رضيات : مرضية مقبولة × مرفوضة - عِذاب : طيبة ، سائغات مقبولات م عذب × مستقبحة ، ممجوجة - حجى : عقل ج أحجاء - ينفذ : يقطع ، يقضي - الرأي الصواب : السليم الصحيح × الخطأ - ذكاء : حصافة ، فطنة × غباء ، بلاهة - ألمعي : صاحب رؤية صائبة ، متوقد ، أريب ، لَوْذَعِي × غبي - الشهاب : الشعلة الساطعة ، النجم المضيء ج شُهُب ، شُهْبَان ، أشْهُب - جمال : حسن × قبح ، دمامة - قدسي : طاهر × دنس - يعاب : يشان ، يذم × يثنى عليه ، يمدح - التراب : ما نعم من أديم الأرض ج أتربة ، تِربان - آه : اسم فعل مضارع بمعنى  أتوجع ، وتحمل معنى الشكاية والتحزُّن .',
                    'explanation': `يعدد شاعرنا الصفات الحسية والمعنوية التي كانت تفرّدت بها ميّ فهي صاحبة الخلق الرفيع الذي لا تشوبه شائبة والذي جعل الجميع يرضي عنها .. وهي صاحبة العقل الراجح ، والرأي السديد ، والذكاء المتوقد والبديهة الحاضرة ، والجمال الشكلي المبهر الذي ليس فيه ما يعاب .
 ورغم كل الصفات الخُلقية والخِلقية التي لا مثيل لها ، فالتراب لم يرحمها بل غيبها في باطن الأرض ، وترك الأسى والحسرة والحزن والألم في نفوس الأصحاب والجلساء .`,
                    'taste': `￼(شِـيـَمٌ غـُرٌّ) : استعارة مكنية ، حيث صور الشاعر الشيم بحصان له غرة ، وسر جمال الصورة : التجسيم ، وتوحي الصورة بجمال ميّ ورفعة مكانتها .
￼(شِـيـَمٌ عِــذابْ) : استعارة مكنية ، حيث صور الشاعر الشيم بماء عذب صافٍ ، وسر جمال الصورة : التجسيم ، وتوحي الصورة بالطهر والنقاء والخلق الطيب.
￼(شِـيـَمٌ - غـُرٌّ - رَضـِيـَّاتٌ - عِــذابْ) : جاءت نكرات للتعظيم ، وجمعاً للكثرة .
￼(شِـيـَمٌ غـُرٌّ رَضـِيـَّاتٌ عِــذابْ) : إيجاز بحذف الخبر ، وتقديره (لها) ، والحذف للتركيز على الصفات الرائعة التي تميزت بها مي .
￼(وحـِجى يـَنـْفـُـذُ بِالرَّأْيِ الصَّوَابْ) : استعارة مكنية ، حيث صور الشاعر عقل (حجى) ميّ بإنسان له رأي دقيق وسديد ، وسر جمال الصورة : التشخيص ، وتوحي الصورة بتميز ميّ العقلي ورجاحة رأيها ، ويجوز أن تكون الصورة كناية عن فطنة وذكاء ورجاحة عقل ميّ .
￼(حـِجى - ِالرَّأْيِ) : محسن بديعي / مراعاة نظير تثير الذهن .
￼(يـَنـْفـُـذُ) : استخدام الفعل المضارع للدلالة على التجدد والاستمرار والحدوث واستحضار الصورة ، والفعل (يـَنـْفـُـذُ) يوحي برجاحة رأيها وعقلها وقوة شخصيتها .
￼(ذَكَاءٌ أَلْمَعـِيٌّ كـَالشـِّهـَابْ) : تشبيه لذكاء ميّ المتوهج بالشهاب المضيء ، فيه تجسيم وتوضيح لتميزها وصواب آرائها .
￼(ذَكَاءٌ أَلْمَعـِيٌّ) : استعارة مكنية ، حيث صور الشاعر ذكاء ميّ بإنسان له رأي دقيق وسديد ، وسر جمال الصورة : التشخيص .
￼(وَجَمَالٌ قـُدْسِيٌّ لا يُعَابْ) : استعارة مكنية ، حيث صور الشاعر جمال مي بشيء مادي مقدس ، وسر جمال الصورة التجسيم ، وتوحي الصورة بشدة طهر ونقاء وجمال مي الملائكي .
￼(لا يُعَابْ) : إيجاز بحذف الفاعل عن طريق بناء الفعل للمجهول يثير الذهن ويفيد العموم والشمول . 
س3 : أي التعبيرات الآتية أدق : (لا يُعَابْ - لم يُعَبْ - لن يُعَابْ) ؟ ولماذا ؟
جـ : التعبير بـ(لا يُعَابْ) أدق ؛ لأن (لا) استمرارية النفي في كل الأوقات فمي هي الجميلة في كل الأوقات ، بينما (لم) تفيد النفي في الماضي فقط ، (لن) تفيد النفي في المستقبل فقط .
￼(شِـيـَمٌ غـُرٌّ .. وحـِجى .. وَذَكَاءٌ .. وَجَمَالٌ ..) : العطف بالواو يفيد تعدد وتنوع الصفات الخُلقية والخِلقية التي تفردت بها مي زيادة .
￼(شِـيـَمٌ .. وحـِجى .. وَذَكَاءٌ .. وَجَمَالٌ ..) : نكرات للتعظيم .
￼(كُلُّ هَذَا فِي التُّرَابْ) : استعارة مكنية حيث صور الشاعر الصفات الخِلقية والخُلقية المميزة التي ذكرها للأديبة مي بأشخاص دفنت في التراب ، وسر الجمال الصورة : التشخيص ، وتوحي بالتحسر وفداحة الخسارة .
￼(كُلُّ هَذَا فِي التُّرَابْ؟) : أسلوب إنشائي / استفهام أداته محذوفة ؛ لإظهار الصدمة والتعجب والإنكار وعدم التصديق والألم والحسرة.
￼(كُلُّ هَذَا فِي التُّرَابْ؟) : إجمال بعد التفصيل في السطور الشعرية السابقة ، و (كل) تفيد العموم والشمول .
￼(آهِ) : اسم فعل مضارع للتوجع والشكوى وفيه تحدٍ للموت ، وصرخة تشعرنا بالألم والمعاناة الشديدة .
￼(آهِ مِنْ هَذَا التُّرَابْ) : استعارة مكنية حيث صور الشاعر التراب بوحش يؤلم بشدة بعد إخفائه لمي ، ويجوز كناية عن الحزن والألم الذي يعتصر قلب الشاعر لفقد مي .
￼(التُّرَابْ) : مجاز مرسل عن القبر علاقته : الكلية ، وسر جمال المجاز : الدقة والإيجاز . `,
                },
                'section4': {
                    'linguistics': ` - فضلها : إحسانها ، مزيتها × إساءتها ج فضول - ثواب : أجر ، جزاء × عقاب .
فروق لغوية :
1 - " هذا ذهب خالص " . أي ذهب صاف.
2 -  " تلبس الفتاة ثوباً خالصاً " . أي شديد البياض ، ناصع اللون .
3 - " بضائع خالصة من الجمارك " . أي معفاة من الرسوم .
4 - " أصبح الرجل خالصاً من كل ديونه " . أي متحرراً من كل دين .
5 - " نسب خالص " : لا شائبة فيه.`,
                    'explanation': `ويتعجب شاعرنا من التراب الذي غيب مي قائلاً إنك لن ترد وتعيد من غيبه الموت في جوفك ، وأن من العبث أن يأمل أحد في ذلك ، ومع قسوة الموت إلا أن شاعرنا يعلن التحدي وهو يخاطب التراب ، فيقول له : إن كنت واريت من مي جسدها وأبعدته عنا إلا أنك غير قادر على أن تحجب مجد مي الأدبي وإبداعاتها الخالدة التي لا سلطان لك عليها ، ولا قدرة لك على إخفائها ؛ لأنها فوق سلطانك وأكبر من قدرتك .. لذلك لها من إبداعاتها - التي ستظل خالدة - خير الجزاء والأجر .  `,
                    'taste': `￼(وَيـْـكَ) : اسم فعل مضارع يفيد الإنكار والتعجب الممزوج بالغضب والزجر والتهديد للتراب .
￼(وَيـْـكَ مَا أَنْـتَ بـِــرَادٍّ ما لديك) : استعارة مكنية ، حيث صور الشاعر التراب بإنسان يخاطبه الشاعر ويرفض رد ورجوع ما لديه من أحبة انتهبهم (اختطفهم وسرقهم) ، وسر جمال الصورة : التشخيص ، وتوحي الصورة بقسوة الموت الذي يختطف الأحبة ويغيّبهم عن الحياة .
￼(أضيع) : اسم تفضيل يوحي بشدة الضياع وقمة الخسارة .
￼(الآمَالِ) : جاءت جمعاً للكثرة كثرة الآمال الضائعة بفقد مي ومعرفة للتعظيم .
￼(بـِــرَادٍّ - ضاع) : محسن بديعي / طباق يبرز المعنى ويوضحه ويقويه بالتضاد .
￼(أضيع - ضاع) :  محسن بديعي / جناس اشتقاقي ناقص يعطي جرساً موسيقياً وإيقاعاً محبباً للأذن .
￼(مَجْـدُ مَيٍّ غـَيْـرُ مَوْكُوْلٍ إِلَيْكَ) : استعارة مكنية حيث صور الشاعر التراب بمحامٍ ليس مفوضاً بالاستحواذ على مجد مي ، وسر جمال الصورة : التشخيص ، وتوحي الصورة بعظمة مجد مي وخلوده الدائم وهو المجد الذي لا يستطيع الموت أن يغيبه أو يحجبه .
￼(مَجْـدُ مَيٍّ) : الإضافة تفيد التخصيص والاعتزاز والسمو ، وتكرار (مَجْـدُ مَيٍّ) لتأكيد خلوده وسمو منزلته وعظمته .
￼(مجد مي خالص من قبضتيكْ) : استعارة مكنية حيث صور الشاعر مجد مي بإنسان يتخلص ويتحرر من قبضة الموت الشرسة ، وسر جمال الصورة : التشخيص ، وتوحي الصورة بدوام وخلود مجد وعظمة ما خلفته من تراث أدبي ، ويجوز أن تكون الصورة كناية عن خلود وبقاء أعمالها الأدبية على مر العصور .
￼(قبضتيكْ) : استعارة مكنية حيث صور الشاعر التراب بإنسان يمتلك قبضتين قويتين ، وسر جمال الصورة : التشخيص .
￼(مجد مي غير موكول إليك / مجد مي خالص من قبضتيك) : إطناب الترادف للتوكيد.
￼(وَلَهَا مِـنْ فـَضْلِهَا أَلْفُ ثـَوَابْ) : كناية عن ثقة الشاعر في عظم أجرها عند الله لما قدمته من أدب عظيم وفضل عميم .
￼(وَلَهَا مِـنْ فـَضْلِهَا أَلْفُ ثـَوَابْ) : أسلوب خبري غرضه الدعاء لمي ، والتعبير بـ(ألف) يدل على كثرة الثواب .
￼(وَلَهَا مِـنْ فـَضْلِهَا أَلْفُ ثـَوَابْ) : أسلوب قصر بتقديم الجار والمجرور (لها من فضلها) على المبتدأ (ألف ثواب) للتخصيص والتوكيد.`,
                }
            };
            document.getElementById(sectionId + '-info').innerText = info[sectionId][type];
        }
    </script>




    <script>
        if ('serviceWorker' in navigator) {
            navigator.serviceWorker.register('/service-worker.js')
            .then(function(registration) {
                console.log('Service Worker registered with scope:', registration.scope);
            }).catch(function(error) {
                console.log('Service Worker registration failed:', error);
            });
        }
    </script>




</body>
</html>
'''


@app.route('/', methods=['GET', 'POST'])
def home():
    selected_text_title = None
    selected_text_content = None
    if request.method == 'POST':
        selected_title = request.form.get('selected_text')
        if selected_title in texts:
            selected_text_title = selected_title
            selected_text_content = texts[selected_title]['text']
    return render_template_string(template,
                                  selected_text_title=selected_text_title,
                                  selected_text_content=selected_text_content,
                                  texts=texts)


@app.route('/ask_question', methods=['POST'])
def ask_question():
    question = request.form.get('question').strip()  # إزالة المسافات الزائدة
    selected_text_title = request.form.get('selected_text')

    question_answer = "السؤال غير موجود"  # إجابة افتراضية

    if selected_text_title in texts:
        text_data = texts[selected_text_title]
        questions = text_data['questions'].keys()

        # استخدم fuzzy matching للبحث عن السؤال الأقرب
        best_match, score = process.extractOne(question, questions)
        print(f"السؤال: {question}, أفضل مطابقة: {best_match}, درجة المطابقة: {score}")

        if score >= 70:  # إذا كانت درجة المطابقة أكثر من أو تساوي 70
            question_answer = text_data['questions'][best_match]

        # إضافة شروط خاصة للأسئلة المختلفة، بدون علامات ترقيم
        normalized_question = question.replace("؟", "").strip()  # إزالة علامة الاستفهام

        if normalized_question in [
            "من الشاعر", 
            "من قائل النص", 
            "من قائل الأبيات", 
            "ما اسم الشاعر"
        ]:
            question_answer = "عباس محمود العقاد"
        
        # إضافة شروط للأسئلة عن العاطفة
        elif normalized_question in [
            "ما العاطفة المسيطرة على الشاعر", 
            "ما عاطفة الشاعر في الأبيات", 
            "ما عاطفة الشاعر في النص", 
            "ما الحالة الوجدانية المسيطرة على الشاعر في النص", 
            "ما الحالة المزاجية للشاعر في النص", 
            "ما الحالة الشعورية للشاعر في النص", 
            "ما إحساس الشاعر في النص"
        ]:
            question_answer = "عاطفة الحزن الشديد والألم على فراق وفقد الأديبة مي زيادة الممتزجة بالإعجاب والانبهار بصفاتها وسجاياها الرائعة التي قلما تتكرر"

        # إضافة شروط للأسئلة عن الغرض الشعري
        elif normalized_question in [
            "ما الغرض الشعري من النص", 
            "من أي أغراض الشعر ينتمي هذا النص وما موقف العقاد منه", 
            "ما الغرض من الأبيات في النص", 
            "ما الغرض الرئيس من النص"
        ]:
            question_answer = "الرثاء، وهو الحديث عن الميت وذكر محاسنه التي كان يحملها في حياته، وهو فن يشع بالصدق فلا رياء فيه، والوفاء شعاره فهو فن شعري حمّال للقيم."

        print(f"الإجابة: {question_answer}")

        # Generate audio response
        answer_audio_url = None
        tts = gTTS(text=question_answer, lang='ar')
        answer_audio_filename = hashlib.md5(question_answer.encode()).hexdigest() + '.mp3'
        answer_audio_path = os.path.join('static', answer_audio_filename)

        if not os.path.exists(answer_audio_path):
            tts.save(answer_audio_path)

        answer_audio_url = f"/static/{answer_audio_filename}"

    return render_template_string(template,
                                  selected_text_title=selected_text_title,
                                  selected_text_content=texts[selected_text_title]['text'],
                                  answer_text=question_answer,
                                  answer_audio_url=answer_audio_url,
                                  texts=texts)


if __name__ == '__main__':
    if not os.path.exists('static'):
        os.makedirs('static')
    app.run(debug=True)

